tube_tworegion/0/liquid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/liquid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0.1 0 );

boundaryField
{
    wall_in-shadow
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    liquid_in
    {
        type            fixedValue;
        value           uniform ( 0 0.1 0 );
    }
    liquid_out
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
	value		uniform (0 0.1 0);
    }
}


// ************************************************************************* //
