tube_tworegion/0/liquid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/liquid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{

    liquid_out
    {
        type            fixedValue;
        value           uniform 100000;
    }
    liquid_in
    {
        type            calculated;
        value           uniform 100000;
    }
    wall_in-shadow
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
