tube_tworegion/0/liquid/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/liquid";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    ".*"
    {
        type            calculated;
        value           uniform 0.1;
    }
    inlet_f
    {
        type            kqRWallFunction;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    outlet_f
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    symmtry_f
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    symmetry_f
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    liquid_in
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
    }
    liquid_out
    {
        type            zeroGradient;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
