tube_tworegion/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 500;

boundaryField
{

    solid_in
    {
        //type            zeroGradient;
        type            fixedValue; //fixedGradient;//zeroGradient;
	value           uniform 500;
    }
    solid_out
    {
        //type            zeroGradient;
        type            fixedValue; //fixedGradient;//zeroGradient;
	value           uniform 500;
    }
    wall_out
    {
        type            fixedValue; //fixedGradient;//zeroGradient;
	value           uniform 500;
    }
    wall_in
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     solidThermo;
        value           uniform 500;
    }
}


// ************************************************************************* //
